In [1]:
import pandas as pd

In [2]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [4]:
df.iloc[0] = [-69, 2, 3, 4]

In [21]:
df.iloc[0, 1:3] = 555

In [22]:
df

      a     b     c     d
0   -69   555   555     4
1   100   200   300   400
2  1000  2000  3000  4000

In [15]:
df.iloc[0, 2] = 999

In [16]:
df

      a     b     c     d
0   -69     2   999     4
1   100   200   300   400
2  1000  2000  3000  4000

In [24]:
df.iloc[1, 2] = -111

In [25]:
df

      a     b     c     d
0   -69   555   555     4
1   100   200  -111   400
2  1000  2000  3000  4000

In [26]:
df.iloc[1, 2] = 'aaa'

In [27]:
df

      a     b     c     d
0   -69   555   555     4
1   100   200   aaa   400
2  1000  2000  3000  4000

In [29]:
df.iloc[0, 1] = 'xxxx'

In [30]:
df

      a     b     c     d
0   -69  xxxx   555     4
1   100   200   aaa   400
2  1000  2000  3000  4000

In [31]:
df.iloc[0][1] = 'yyy'

/tmp/ipykernel_58024/2876053293.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[0][1] = 'yyy'

In [33]:
df.iloc[0,1] = 'yyy'

In [34]:
df

      a     b     c     d
0   -69   yyy   555     4
1   100   200   aaa   400
2  1000  2000  3000  4000